[
  {
    "name": "Choose A Preferred Playing Mode",
    "image": "110.png",
    "description": [
      "111.png",
      "The story of Ice Scream: Horror Neighborhood begins with you witnessing a kidnapping scene. As it turns out, the ice-cream seller is a paranormal creature, and you are the only one who saw what happened. To help the boy who was taken, you should grab the rope from the drawer and go down through the window. Once you reach the ground, you will be in danger of being spotted by Rod, the ice-cream man. By being sneaky and clever, you should be able to follow the clues and solve the conundrum.",
      "112.png",
      "Well, the game offers three different ways of achieving the objective. In a way, the modes represent three levels of difficulty. As such, they are called: Ghost, Normal, and Hard. For example, the Ghost level will let you walk around Rod without him being able to see you. On the other hand, the Hard mode will see him sprint after you and hear every noise you make.",
      "113.png"
    ]
  },
  {
    "name": "Stay Out Of Sight And Be Quiet At All Times",
    "image": "120.png",
    "description": [
      "121.png",
      "Ice Scream: Horror Neighborhood will present you with an eerie atmosphere and lots of dramatic scenes. Of course, the sound effects also boost the tension and make your blood run cold. Yet, the music can be your ally as well. For instance, once the tempo changes and the music quickens, you should get up and run because you’ve been spotted! Then again, when the music dies down and all you hear is Rod’s mumbling, you can relax because you managed to escape.",
      "122.png",
      "So, the goal of the game is to avoid being eaten by the gruesome ice-cream man. Luckily, several methods can help you stay undetected. First of all, the icon on the right-hand side will allow you to duck and hide behind low objects. Also, you can ‘vanish’ by jumping into trash cans or dog houses. Either way, Rod will walk right past your spot. On top of that, try to make as little noise as possible!",
      "123.png"
    ]
  },
  {
    "name": "Watch Videos To Receive Hints And Clues",
    "image": "130.jpg",
    "description": [
      "131.png",
      "In essence, Ice Scream: Horror Neighborhood will test your intelligence and creativity. In fact, this brainteaser is packed with challenging tasks and mysteries that wait for you to solve them. Yet, the poltergeist will not let you stroll around the neighborhood and solve puzzles in a relaxed manner. On the contrary, he’ll be on your tail at all times, which means that you need to work fast and think even faster.",
      "132.png",
      "Nonetheless, the game will provide you with a helpful set of hints to facilitate the process of solving the mysteries. So, the icon in the upper left corner will take you to the section with all the clues. They are divided into two groups – the items and the puzzles. And, you will have to watch an ad for every one of the hints. Once you complete a set, a yellow star will shine in the corner of the icon of a particular hint.",
      "133.png"
    ]
  },
  {
    "name": "Use The Map To Travel From One Location To The Other",
    "image": "140.png",
    "description": [
      "141.png",
      "As the title of the game implies, the ice-cream monster will torment the entire neighborhood, not just one home. So, your task will be to cover the area and look for clues in several different locations. Needless to say, going on foot would be a risky endeavor. Therefore, let’s steal the ice-cream truck and drive from one spot to the other. Less risky? Sure, it is.",
      "142.png",
      "But before you unlock the option of traveling by van, you have to find a map of the neighborhood. As it happens, Rod will drop the map in front of your home. Once you pick it up and take it inside of the truck, you can then switch from one location to the other. Each of the spots hides different objects and clues, so make sure to explore the places as much as possible. The available locations are the Cafeteria, Parking Lot, Playground, and the Stall.",
      "143.png"
    ]
  },
  {
    "name": "First Go To The Cafeteria",
    "image": "150.png",
    "description": [
      "151.png",
      "Even though the hints in the game will be of great use, our Ice Scream: Horror Neighborhood guide will provide you with useful shortcuts as well. For that reason, here are a couple of actions you should take to get closer to solving the case.",
      "152.png",
      "So, the first stop on your journey should be the Cafeteria. No, you will not have time to have some coffee. On the contrary, you will need to find a way inside, even though Rod will wait for you there. To be precise, he will step outside once you get near the entrance. Thus, the best course of action is to hide in the trash can. After he strolls away, go inside and search for workwear. It should be hanging on the kitchen wall. Once you learn the name of the worker in charge of the storage, get back to the ice-cream truck.",
      "153.png"
    ]
  },
  {
    "name": "Explore The Playground And Find The Guard’s Jacket",
    "image": "160.png",
    "description": [
      "161.jpg",
      "After you visit the Cafeteria and learn that Brad is in charge of the storage room, you should head to the Playground. Needless to say, the location is available on the map, in the upper right corner. Once you arrive, you will see that the children’s playground is built in a circular shape, which allows you to go around and avoid meeting Rod face to face.",
      "162.png",
      "The purpose of going to the Playground in the first place is to find the guard’s jacket. At first, you may struggle with this task because the jacket is hidden in a dark place. Yet, the hints section can provide you with the necessary clue. Either way, the jacket is hidden in the wooden tower, which stands as a part of the jungle gym. So, find the perfect moment to slip past the ice-cream seller and climb up the tower. Once you grab the jacket, get back to the van, slow and easy!",
      "163.png"
    ]
  },
  {
    "name": "Visit The Parking Lot And Unlock The Office Room",
    "image": "170.png",
    "description": [
      "171.png",
      "To be fair, the darkness of the playground will certainly boost the eeriness of the atmosphere in Ice Scream: Horror Neighborhood. For that reason, the bright lights in the underground parking area will come as a relief. However, this may not be the case. Of course, the creepy monster will wait for you in the parking lot as well. So, get ready to play hide and seek.",
      "172.png",
      "While you run from the ice-cream man, you should also search for the main office. This room is located on the second floor so you need to find a way to get there without being spotted. Either way, once you reach the room, the key from the guard’s jacket will unlock the door. Once inside, check the briefcase on the table and find Brad’s ID card. Remember, Brad is the one who has access to the storage room so you will need his card to enter. Pick up the card and get back to the Cafeteria as soon as possible.",
      "173.png"
    ]
  },
  {
    "name": "Escape From The Stall If You Get Caught",
    "image": "180.png",
    "description": [
      "181.jpg",
      "OK, these tips should point you in the right direction when it comes to solving the mysteries in Ice Scream: Horror Neighborhood. After all, we cannot tell you every little secret. Where’s the fun in that? So, continue exploring the premises and use the hints to solve the conundrum. Yet, mistakes will happen every once in a while. In other words, you will be ‘consumed’ by the dreaded poltergeist. If you play the game on the Normal level, you will have three chances to continue working on the case.",
      "182.png",
      "To clarify, you will be transported to the Stall, which is basically the secret lair of the evil ice-cream seller. Yet, his improvised prison room will have flaws that you must take advantage of. In the first instance, the trick will be to connect the wires on the wall. After that, the blinds will open with the help of electricity. When you get caught the second time, Rod will seal the door and you will not be able to open them. Instead, you must use the slingshot to break the glass on the window. And, the last situation will see you removing the nails and planks on the window to get out. There you have it! This wraps up our comprehensive Ice Scream: Horror Neighborhood beginner’s guide. Of course, we would like to hear your thoughts on the game. So, if you happen to know any other tips or tricks, then feel free to leave us a comment below!",
      "183.png"
    ]
  }
]


